src/ut10_old/AccumulationRegisters/ТоварыВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРознице</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПродажная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/ut10_old/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/WebServices/tbk/Ext/Module.bsl
Функция remnants() 
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТоварыВРозницеОстатки.Склад.Наименование КАК СкладНаименование,
	               |	ТоварыВРозницеОстатки.Склад.Код КАК СкладКод,
	               |	ТоварыВРозницеОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыВРозницеОстатки.Номенклатура.Код КАК НоменклатураКод,
	               |	ЕСТЬNULL(ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры.Наименование, """") КАК ХарактеристикаНоменклатурыНаименование,
	               |	ТоварыВРозницеОстатки.КоличествоОстаток,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.ТипЦен.Наименование, """") КАК ТипЦенНаименование,
	               |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	               |ПОМЕСТИТЬ ОстаткиЦены
	               |ИЗ
	               |	РегистрНакопления.ТоварыВРознице.Остатки КАК ТоварыВРозницеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних КАК ЦеныНоменклатурыСрезПоследних
	               |		ПО ТоварыВРозницеОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	               |			И (ЦеныНоменклатурыСрезПоследних.ТипЦен = &типЦены)
	               |			И (НЕ ТоварыВРозницеОстатки.Номенклатура.ВестиУчетПоХарактеристикам
	               |				ИЛИ ТоварыВРозницеОстатки.ХарактеристикаНоменклатуры = ЦеныНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗначенияСвойствОбъектов.Объект,
	               |	ЗначенияСвойствОбъектов.Значение
	               |ПОМЕСТИТЬ ТаблицаНеВыгружатьНаСайт
	               |ИЗ
	               |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	               |ГДЕ
	               |	ЗначенияСвойствОбъектов.Свойство = &Свойство
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиЦены.СкладНаименование,
	               |	ОстаткиЦены.СкладКод,
	               |	ОстаткиЦены.Номенклатура,
	               |	ОстаткиЦены.НоменклатураКод,
	               |	ОстаткиЦены.ХарактеристикаНоменклатурыНаименование,
	               |	ОстаткиЦены.КоличествоОстаток,
	               |	ОстаткиЦены.ТипЦенНаименование,
	               |	ОстаткиЦены.Цена,
	               |	ЕСТЬNULL(ТаблицаНеВыгружатьНаСайт.Значение, ЛОЖЬ) КАК НеВыгружатьНаСайт
	               |ПОМЕСТИТЬ Итог
	               |ИЗ
	               |	ОстаткиЦены КАК ОстаткиЦены
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаНеВыгружатьНаСайт КАК ТаблицаНеВыгружатьНаСайт
	               |		ПО ОстаткиЦены.Номенклатура = ТаблицаНеВыгружатьНаСайт.Объект
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Итог.СкладНаименование,
	               |	Итог.СкладКод,
	               |	Итог.Номенклатура,
	               |	Итог.НоменклатураКод,
	               |	Итог.ХарактеристикаНоменклатурыНаименование,
	               |	Итог.КоличествоОстаток,
	               |	Итог.ТипЦенНаименование,
	               |	Итог.Цена
	               |ИЗ
	               |	Итог КАК Итог
	               |ГДЕ
	               |	Итог.НеВыгружатьНаСайт = ЛОЖЬ";
				   
				   
	Результат = новый массив;
	макетСтруктуры = "СкладНаименование,СкладКод,НоменклатураУИ,НоменклатураКод,ХарактеристикаНоменклатурыНаименование,КоличествоОстаток,ТипЦенНаименование,Цена";
	
	типЦены = Справочники.ТипыЦенНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор("ec5b124a-ef8e-11e6-9ce5-0cc47aabb907"));
	Запрос.УстановитьПараметр("типЦены",типЦены);
	
	Запрос.УстановитьПараметр("Свойство",ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("УТ0000028")); //свойство не выгружать на сайт

	
	рез = Запрос.Выполнить().Выбрать();
	
	Пока рез.Следующий() Цикл
		нЗапись = Новый Структура(макетСтруктуры);
		ЗаполнитьЗначенияСвойств(нЗапись,рез);
		нЗапись.НоменклатураКод = рез.Номенклатура.УникальныйИдентификатор();
		
		Для каждого эл из нЗапись цикл
			если ТипЗнч(эл.Значение) <> Тип("Число") Тогда
				нЗапись[эл.Ключ]=строка(эл.Значение);
			КонецЕсли;
		КонецЦикла;
		
		Результат.Добавить(нЗапись);
	КонецЦикла;	
	
	Возврат СтруктураВjson(Результат);

	
КонецФункции



Функция СтруктураВjson(Значение)

	Если Значение = неопределено Тогда
		возврат "";
	КонецЕсли; 	
	
    ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	СтрJSON = ЗаписьJSON.Закрыть();
	
	возврат СтрJSON;

КонецФункции
